[
  {
    "name": "Playford Men's Shed",
    "tags": [
      "Gridsome",
      "Vue.js",
      "GraphQL",
      "Tailwind CSS",
      "Google Maps API"
    ],
    "description": [
      "A website for the Playford Men's Shed community  group. I used the Vue.js static site generator Gridsome, to create a super-fast, accessibly and SEO-friendly website.",
      "A GraphQL query is used to pull in project images and information. The contact page has dynamic form validation and a Google Map for the location.",
      "The site was created as part of my TAFE SA Workplace Project, where we create products for real clients."
    ],
    "imgFile": "playford-mens-shed.png",
    "imgAlt": "Preview of the Playford Men's Shed website",
    "demoUrl": "https://playfordms.netlify.app/"
  },
  {
    "name": "Dev Domain",
    "tags": ["AngularJS", "PHP", "MySQL", "Tailwind CSS", "Google Maps API"],
    "description": [
      "A website for a fictional developer community. This site has a membership registration and log in functionality that allows users to update their details. Sessions are used to maintain logged in status.",
      "AngularJS is used to handle dynamic form validation and HTTP requests to a PHP script that connects to the database.",
      "A select number of tweets are pulled in on the News page using the Twitter for Websites API. Event information is pulled in from the database, and Google Maps is used to display event locations."
    ],
    "imgFile": "dev-domain.png",
    "imgAlt": "Preview of Dev Domain website",
    "demoUrl": "https://shrouded-escarpment-47748.herokuapp.com/"
  },
  {
    "name": "Damn Fine Coffee",
    "tags": ["PHP", "MySQL", "Tailwind CSS", "JavaScript", "AngularJS"],
    "description": [
      "An e-commerce site for a fictional online business that specialises in coffee beans and brewing equipment. Built in PHP, the site uses sessions to maintain logged in status and cart state.",
      "Products can be viewed on te store page, or through an AJAX search input. The search function generates suggestions that link to products as the user types, as well as generating a results page with all matching products.",
      "The shopping cart allows for users to change the quantity and remove items. A logged in user can checkout using PayPal in sandbox mode. Users can also see their order history."
    ],
    "imgFile": "damn-fine-coffee.png",
    "imgAlt": "Preview of Damn Fine Coffee website",
    "demoUrl": "https://tranquil-plateau-75150.herokuapp.com/"
  }
]
